app/controllers/api/notebooks_controller.rb

SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @notebook = Notebook.find(params[:id])