app/controllers/api/notes_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @note = Note.find(params[:id])

INSERT INTO "notes" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New Note"], ["body", ""], ["author_id", 1], ["created_at", "2021-05-18 15:52:44.436735"], ["updated_at", "2021-05-18 15:52:44.436735"]]
---
    def create
        @note = Note.new(note_params)

        if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "notes"."id" = $4  [["title", "Change the name of this note"], ["body", "<p>E</p>"], ["updated_at", "2021-05-19 13:25:48.734959"], ["id", 24]]
---
    def update
        @note = Note.find(params[:id])

        if @note.update(note_params)

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 5]]
---
    def destroy
        @note = Note.find(params[:id])

        if @note.destroy